CoreMaker-lab/LSM6DSV80X/STM32H5_LSM6DSV80_Project4/Core/Inc/lsm6dsv80x_reg.h
#define LSM6DSV80X_FSM_EXT_MATRIX_XX_H            0xC7U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_xx               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_xx               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_xx_h_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_XY_L            0xC8U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_xy               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_xy               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_xy_l_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_XY_H            0xC9U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_xy               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_xy               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_xy_h_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_XZ_L            0xCAU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_xz               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_xz               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_xz_l_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_XZ_H            0xCBU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_xz               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_xz               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_xz_h_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_YY_L            0xCCU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_yy               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_yy               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_yy_l_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_YY_H            0xCDU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_yy               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_yy               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_yy_h_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_YZ_L            0xCEU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_yz               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_yz               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_yz_l_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_YZ_H            0xCFU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_yz               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_yz               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_yz_h_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_ZZ_L            0xD0U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_zz               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_zz               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_zz_l_t;

#define LSM6DSV80X_FSM_EXT_MATRIX_ZZ_H            0xD1U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_zz               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_zz               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_ext_matrix_zz_h_t;

#define LSM6DSV80X_EXT_CFG_A                      0xD4U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ext_z_axis                   : 3;
  uint8_t not_used0                    : 1;
  uint8_t ext_y_axis                   : 3;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t ext_y_axis                   : 3;
  uint8_t not_used0                    : 1;
  uint8_t ext_z_axis                   : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_ext_cfg_a_t;

#define LSM6DSV80X_EXT_CFG_B                      0xD5U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ext_x_axis                   : 3;
  uint8_t not_used0                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 5;
  uint8_t ext_x_axis                   : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_ext_cfg_b_t;

/**
  * @}
  *
  */

/** @defgroup bitfields_page_pg1_emb_adv Bitfields Page pg1_emb_adv
  * @{
  *
  */
#define LSM6DSV80X_EMB_ADV_PG_1                   0x100U

#define LSM6DSV80X_XL_HG_SENSITIVITY_L            0x58U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl_hg_s                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t xl_hg_s                      : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_xl_hg_sensitivity_l_t;

#define LSM6DSV80X_XL_HG_SENSITIVITY_H            0x59U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl_hg_s                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t xl_hg_s                      : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_xl_hg_sensitivity_h_t;

#define LSM6DSV80X_FSM_LC_TIMEOUT_L               0x7AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc_timeout               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc_timeout               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_lc_timeout_l_t;

#define LSM6DSV80X_FSM_LC_TIMEOUT_H               0x7BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc_timeout               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc_timeout               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_lc_timeout_h_t;

#define LSM6DSV80X_FSM_PROGRAMS                   0x7CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_n_prog                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_n_prog                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_programs_t;

#define LSM6DSV80X_FSM_START_ADD_L                0x7EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_start                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_start                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsv80x_fsm_start_add_l_t;

