CoreMaker-lab/LSM6DSV80X/STM32H5_LSM6DSV80_Project4/Core/Inc/lsm6dsv80x_reg.h
typedef enum
{
  LSM6DSV80X_GY_HIGH_PERFORMANCE_MD   = 0x0,
  LSM6DSV80X_GY_HIGH_ACCURACY_ODR_MD  = 0x1,
  LSM6DSV80X_GY_ODR_TRIGGERED_MD      = 0x3,
  LSM6DSV80X_GY_SLEEP_MD              = 0x4,
  LSM6DSV80X_GY_LOW_POWER_MD          = 0x5,
} lsm6dsv80x_gy_mode_t;

/**
  * @brief  Gyroscope operating mode selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      GY_HIGH_PERFORMANCE_MD, GY_HIGH_ACCURACY_ODR_MD, GY_SLEEP_MD, GY_LOW_POWER_MD,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_gy_mode_set(const stmdev_ctx_t *ctx, lsm6dsv80x_gy_mode_t val)
__attribute__((deprecated("Use gy_setup function")));

/**
  * @brief  Gyroscope operating mode selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      GY_HIGH_PERFORMANCE_MD, GY_HIGH_ACCURACY_ODR_MD, GY_SLEEP_MD, GY_LOW_POWER_MD,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_gy_mode_get(const stmdev_ctx_t *ctx, lsm6dsv80x_gy_mode_t *val);

/**
  * @brief  Register address automatically incremented during a multiple byte access with a serial interface (enable by default).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Register address automatically incremented during a multiple byte access with a serial interface (enable by default).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_auto_increment_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Register address automatically incremented during a multiple byte access with a serial interface (enable by default).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Register address automatically incremented during a multiple byte access with a serial interface (enable by default).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_auto_increment_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Block Data Update (BDU): output registers are not updated until LSB and MSB have been read). [set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Block Data Update (BDU): output registers are not updated until LSB and MSB have been read).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_block_data_update_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Block Data Update (BDU): output registers are not updated until LSB and MSB have been read). [get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Block Data Update (BDU): output registers are not updated until LSB and MSB have been read).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_block_data_update_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Configure ODR trigger. [set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      number of data in the reference period.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_odr_trig_cfg_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Configure ODR trigger. [get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      number of data in the reference period.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_odr_trig_cfg_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV80X_DRDY_LATCHED = 0x0,
  LSM6DSV80X_DRDY_PULSED  = 0x1,
} lsm6dsv80x_data_ready_mode_t;

/**
  * @brief  Enables pulsed data-ready mode (~75 us).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DRDY_LATCHED, DRDY_PULSED,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv80x_data_ready_mode_t val);

/**
  * @brief  Enables pulsed data-ready mode (~75 us).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DRDY_LATCHED, DRDY_PULSED,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv80x_data_ready_mode_t *val);

/**
  * @defgroup   HG High-g Configuration
  * @brief      This section groups all the functions that manage
  *             High-g
  * @{
  *
  */

typedef struct
{
  uint8_t hg_event                     : 1;
  uint8_t hg_wakeup_z                  : 1;
  uint8_t hg_wakeup_y                  : 1;
  uint8_t hg_wakeup_x                  : 1;
  uint8_t hg_wakeup                    : 1;
  uint8_t hg_wakeup_chg                : 1;
  uint8_t hg_shock                     : 1;
  uint8_t hg_shock_change              : 1;
} lsm6dsv80x_hg_event_t;

/**
  * @brief   High-g event handling[get]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    High-g event.
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_hg_event_get(const stmdev_ctx_t *ctx, lsm6dsv80x_hg_event_t *val);

typedef struct
{
  uint8_t hg_wakeup_ths                  : 8;
  uint8_t hg_shock_dur                   : 4;
} lsm6dsv80x_hg_wake_up_cfg_t;

/**
  * @brief  High-g event configuration.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv80x_hg_wake_up_cfg_t structure
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_hg_wake_up_cfg_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv80x_hg_wake_up_cfg_t val);

/**
  * @brief  High-g event configuration.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv80x_hg_wake_up_cfg_t structure
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_hg_wake_up_cfg_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv80x_hg_wake_up_cfg_t *val);

typedef struct
{
  uint8_t hg_interrupts_enable         : 1;
  uint8_t hg_wakeup_int_sel            : 1;
} lsm6dsv80x_hg_wu_interrupt_cfg_t;

/**
 * @brief   High-g wake-up interrupt configuration[set]
 *
 * @param  ctx    Read / write interface definitions.(ptr)
 * @param  val    lsm6dsv80x_hg_wu_interrupt_cfg_t.
 * @retval        Interface status (MANDATORY: return 0 -> no Error).
 *
 */
int32_t lsm6dsv80x_hg_wu_interrupt_cfg_set(const stmdev_ctx_t *ctx,
                                           lsm6dsv80x_hg_wu_interrupt_cfg_t val);

/**
 * @brief   High-g wake-up interrupt configuration[get]
 *
 * @param  ctx    Read / write interface definitions.(ptr)
 * @param  val    lsm6dsv80x_hg_wu_interrupt_cfg_t.
 * @retval        Interface status (MANDATORY: return 0 -> no Error).
 *
 */
int32_t lsm6dsv80x_hg_wu_interrupt_cfg_get(const stmdev_ctx_t *ctx,
                                           lsm6dsv80x_hg_wu_interrupt_cfg_t *val);

/**
 * @brief   Emable/disable user offset data correction driving to hg embedded functions[set]
 *
 * @param  ctx    Read / write interface definitions.(ptr)
 * @param  val    0: disable, 1: enable
 * @retval        Interface status (MANDATORY: return 0 -> no Error).
 *
 */
int32_t lsm6dsv80x_hg_emb_usr_off_correction_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
 * @brief   Emable/disable user offset data correction driving to hg embedded functions[get]
 *
 * @param  ctx    Read / write interface definitions.(ptr)
 * @param  val    0: disable, 1: enable
 * @retval        Interface status (MANDATORY: return 0 -> no Error).
 *
 */
int32_t lsm6dsv80x_hg_emb_usr_off_correction_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
 * @brief   Emable/disable user offset data correction driving to hg wake-up[set]
 *
 * @param  ctx    Read / write interface definitions.(ptr)
 * @param  val    0: disable, 1: enable
 * @retval        Interface status (MANDATORY: return 0 -> no Error).
 *
 */
int32_t lsm6dsv80x_hg_wu_usr_off_correction_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
 * @brief   Emable/disable user offset data correction driving to hg wake-up[get]
 *
 * @param  ctx    Read / write interface definitions.(ptr)
 * @param  val    0: disable, 1: enable
 * @retval        Interface status (MANDATORY: return 0 -> no Error).
 *
 */
int32_t lsm6dsv80x_hg_wu_usr_off_correction_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  High-g accelerometer peak tracking enable.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0: disable, 1: enable
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_xl_hg_peak_tracking_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  High-g accelerometer peak tracking enable.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0: disable, 1: enable
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_xl_hg_peak_tracking_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Hihg-g accelerometer sensitivity value register for FSM and MLC.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Hihg-g accelerometer sensitivity value
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_xl_hg_sensitivity_set(const stmdev_ctx_t *ctx, uint16_t val);

/**
  * @brief  Hihg-g accelerometer sensitivity value register for FSM and MLC.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Hihg-g accelerometer sensitivity value
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_xl_hg_sensitivity_get(const stmdev_ctx_t *ctx, uint16_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup   interrupt_pins Interrupt Pins Configuration
  * @brief      This section groups all the functions that manage routing events
  *             on interrupt pins
  * @{
  *
  */

typedef struct
{
  uint8_t drdy_xl                      : 1;
  uint8_t drdy_g                       : 1;
  uint8_t fifo_th                      : 1;
  uint8_t fifo_ovr                     : 1;
  uint8_t fifo_full                    : 1;
  uint8_t cnt_bdr                      : 1;
  uint8_t shub                         : 1;
  uint8_t sixd                         : 1;
  uint8_t single_tap                   : 1;
  uint8_t double_tap                   : 1;
  uint8_t wakeup                       : 1;
  uint8_t freefall                     : 1;
  uint8_t sleep_change                 : 1;
} lsm6dsv80x_pin_int1_route_t;

typedef struct
{
  uint8_t drdy_xl                      : 1;
  uint8_t drdy_g                       : 1;
  uint8_t drdy_temp                    : 1;
  uint8_t fifo_th                      : 1;
  uint8_t fifo_ovr                     : 1;
  uint8_t fifo_full                    : 1;
  uint8_t cnt_bdr                      : 1;
  uint8_t timestamp                    : 1;
  uint8_t sixd                         : 1;
  uint8_t single_tap                   : 1;
  uint8_t double_tap                   : 1;
  uint8_t wakeup                       : 1;
  uint8_t freefall                     : 1;
  uint8_t sleep_change                 : 1;
  uint8_t emb_func_endop               : 1;
} lsm6dsv80x_pin_int2_route_t;

typedef struct
{
  uint8_t drdy_hg_xl                   : 1; /* High-g */
  uint8_t hg_wakeup                    : 1;
  uint8_t hg_shock_change              : 1;
} lsm6dsv80x_pin_int_route_hg_t;

typedef struct
{
  uint8_t step_detector                : 1; /* Embedded Functions */
  uint8_t tilt                         : 1;
  uint8_t sig_mot                      : 1;
  uint8_t fsm1                         : 1; /* FSM */
  uint8_t fsm2                         : 1;
  uint8_t fsm3                         : 1;
  uint8_t fsm4                         : 1;
  uint8_t fsm5                         : 1;
  uint8_t fsm6                         : 1;
  uint8_t fsm7                         : 1;
  uint8_t fsm8                         : 1;
  uint8_t mlc1                         : 1; /* MLC */
  uint8_t mlc2                         : 1;
  uint8_t mlc3                         : 1;
  uint8_t mlc4                         : 1;
  uint8_t mlc5                         : 1;
  uint8_t mlc6                         : 1;
  uint8_t mlc7                         : 1;
  uint8_t mlc8                         : 1;
} lsm6dsv80x_pin_int_route_emb_t;

/**
  * @brief   Select the signals that need to be routed on int1 pad.[set]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals to route on int1 pin.
  *                (xl/g drdy, fifo, 6d/tap/wu/ff/sleep_change/cnt_bdr)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int1_route_set(const stmdev_ctx_t *ctx, lsm6dsv80x_pin_int1_route_t *val);

/**
  * @brief  Report the signals that are routed on int1 pad.[get]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals that are routed on int1 pin.(ptr)
  *                (xl/g drdy, fifo, 6d/tap/wu/ff/sleep_change/cnt_bdr)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int1_route_get(const stmdev_ctx_t *ctx, lsm6dsv80x_pin_int1_route_t *val);

/**
  * @brief   Select the signals that need to be routed on int2 pad.[set]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals to route on int1 pin.
  *                (xl/g drdy, fifo, 6d/tap/wu/ff/sleep_change/cnt_bdr)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int2_route_set(const stmdev_ctx_t *ctx, lsm6dsv80x_pin_int2_route_t *val);

/**
  * @brief  Report the signals that are routed on int2 pad.[get]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals that are routed on int1 pin.(ptr)
  *                (xl/g drdy, fifo, 6d/tap/wu/ff/sleep_change/cnt_bdr)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int2_route_get(const stmdev_ctx_t *ctx, lsm6dsv80x_pin_int2_route_t *val);

/**
  * @brief   Select the signals that need to be routed on int1 pad.[set]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals to route on int1 pin.
  *                (HG events only)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int1_route_hg_set(const stmdev_ctx_t *ctx,
                                         lsm6dsv80x_pin_int_route_hg_t *val);

/**
  * @brief  Report the signals that are routed on int1 pad.[get]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals that are routed on int1 pin.(ptr)
  *                (HG events only)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int1_route_hg_get(const stmdev_ctx_t *ctx,
                                         lsm6dsv80x_pin_int_route_hg_t *val);

/**
  * @brief   Select the signals that need to be routed on int2 pad.[set]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals to route on int2 pin.
  *                (HG events only)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int2_route_hg_set(const stmdev_ctx_t *ctx,
                                         lsm6dsv80x_pin_int_route_hg_t *val);

/**
  * @brief  Report the signals that are routed on int2 pad.[get]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals that are routed on int2 pin.(ptr)
  *                (HG events only)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int2_route_hg_get(const stmdev_ctx_t *ctx,
                                         lsm6dsv80x_pin_int_route_hg_t *val);

/**
  * @brief   Select the signals that need to be routed on int1 pad.[set]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals to route on int1 pin.
  *                (embedded events)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int1_route_embedded_set(const stmdev_ctx_t *ctx,
                                               lsm6dsv80x_pin_int_route_emb_t *val);

/**
  * @brief   Report the signals that are routed on int1 pad.[get]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals to route on int1 pin.
  *                (embedded events)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int1_route_embedded_get(const stmdev_ctx_t *ctx,
                                               lsm6dsv80x_pin_int_route_emb_t *val);

/**
  * @brief   Select the signals that need to be routed on int2 pad[set]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals to route on int2 pin.
  *                (embedded events)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int2_route_embedded_set(const stmdev_ctx_t *ctx,
                                               lsm6dsv80x_pin_int_route_emb_t *val);

/**
  * @brief   Report the signals that are routed on int2 pad.[get]
  *
  * @param  ctx    Read / write interface definitions.(ptr)
  * @param  val    the signals to route on int2 pin.
  *                (embedded events)
  * @retval        Interface status (MANDATORY: return 0 -> no Error).
  *
  */
int32_t lsm6dsv80x_pin_int2_route_embedded_get(const stmdev_ctx_t *ctx,
                                               lsm6dsv80x_pin_int_route_emb_t *val);
/**
  * @}
  *
  */

typedef struct
{
  uint8_t enable                       : 1; /* interrupt enable */
  uint8_t lir                          : 1; /* interrupt pulsed or latched */
} lsm6dsv80x_interrupt_mode_t;

/**
  * @brief  Enables interrupt.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      enable/disable, latched/pulsed
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_interrupt_enable_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv80x_interrupt_mode_t val);

/**
  * @brief  Enables latched interrupt mode.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      enable/disable, latched/pulsed
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_interrupt_enable_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv80x_interrupt_mode_t *val);

