CoreMaker-lab/LSM6DSV80X/STM32H5_LSM6DSV80_Project4/Core/Inc/lsm6dsv80x_reg.h
typedef enum
{
  LSM6DSV80X_DEN_ACT_LOW  = 0x0,
  LSM6DSV80X_DEN_ACT_HIGH = 0x1,
} lsm6dsv80x_den_polarity_t;

/**
  * @brief  It changes the polarity of INT2 pin input trigger for data enable (DEN) or embedded functions.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEN_ACT_LOW, DEN_ACT_HIGH,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_den_polarity_set(const stmdev_ctx_t *ctx,
                                    lsm6dsv80x_den_polarity_t val);

/**
  * @brief  It changes the polarity of INT2 pin input trigger for data enable (DEN) or embedded functions.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEN_ACT_LOW, DEN_ACT_HIGH,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_den_polarity_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv80x_den_polarity_t *val);

/**
  * @}
  *
  */

/**
  * @brief HAODR set
  *        Allow changing the HAODR mode, which is a shared bit between the accelerometer
  *        and gyroscope. This function must be used if both sensors are already ON and a
  *        different HAODR mode is requested.
  *        Both data rates should use the same HAODR configuration.
  *
  * @param  ctx        read / write interface definitions
  * @param  xl_odr     lsm6dsv80x_data_rate_t
  * @param  xl_mode    lsm6dsv80x_xl_mode_t
  * @param  gy_odr     lsm6dsv80x_data_rate_t
  * @param  gy_mode    lsm6dsv80x_gy_mode_t
  */
int32_t lsm6dsv80x_haodr_set(
  const stmdev_ctx_t *ctx,
  lsm6dsv80x_data_rate_t xl_odr,
  lsm6dsv80x_xl_mode_t xl_mode,
  lsm6dsv80x_data_rate_t gy_odr,
  lsm6dsv80x_gy_mode_t gy_mode);

/**
  * @brief Sensor xl setup
  *        If both accelerometer and gyroscope are ON and HAODR mode needs
  *        to be changed, `lsm6dsv80x_haodr_set` must be used; otherwise,
  *        this function will fail since HAODR is a shared bit.
  *
  * @param  ctx        read / write interface definitions
  * @param  xl_odr     lsm6dsv80x_data_rate_t
  * @param  xl_mode    lsm6dsv80x_xl_mode_t
  */
int32_t lsm6dsv80x_xl_setup(
  const stmdev_ctx_t *ctx,
  lsm6dsv80x_data_rate_t xl_odr,
  lsm6dsv80x_xl_mode_t xl_mode);

/**
  * @brief Sensor gy setup
  *        If both accelerometer and gyroscope are ON and HAODR mode needs
  *        to be changed, `lsm6dsv80x_haodr_set` must be used; otherwise,
  *        this function will fail since HAODR is a shared bit.
  *
  * @param  ctx        read / write interface definitions
  * @param  gy_odr     lsm6dsv80x_data_rate_t
  * @param  gy_mode    lsm6dsv80x_gy_mode_t
  */
int32_t lsm6dsv80x_gy_setup(
  const stmdev_ctx_t *ctx,
  lsm6dsv80x_data_rate_t gy_odr,
  lsm6dsv80x_gy_mode_t gy_mode);

/**
  * @defgroup  FIFO FIFO Configuration
  * @brief     This section group all the functions concerning the FIFO usage
  * @{
  *
  */

/**
  * @brief  FIFO watermark threshold (1 LSb = TAG (1 Byte) + 1 sensor (6 Bytes) written in FIFO).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      FIFO watermark threshold (1 LSb = TAG (1 Byte) + 1 sensor (6 Bytes) written in FIFO).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_fifo_watermark_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  FIFO watermark threshold (1 LSb = TAG (1 Byte) + 1 sensor (6 Bytes) written in FIFO).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      FIFO watermark threshold (1 LSb = TAG (1 Byte) + 1 sensor (6 Bytes) written in FIFO).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_fifo_watermark_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV80X_CMP_DISABLE = 0x0,
  LSM6DSV80X_CMP_8_TO_1  = 0x1,
  LSM6DSV80X_CMP_16_TO_1 = 0x2,
  LSM6DSV80X_CMP_32_TO_1 = 0x3,
} lsm6dsv80x_fifo_compress_algo_t;

/**
  * @brief  It configures the compression algorithm to write non-compressed data at each rate.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      CMP_DISABLE, CMP_ALWAYS, CMP_8_TO_1, CMP_16_TO_1, CMP_32_TO_1,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_fifo_compress_algo_set(const stmdev_ctx_t *ctx,
                                          lsm6dsv80x_fifo_compress_algo_t val);

/**
  * @brief  It configures the compression algorithm to write non-compressed data at each rate.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      CMP_DISABLE, CMP_ALWAYS, CMP_8_TO_1, CMP_16_TO_1, CMP_32_TO_1,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_fifo_compress_algo_get(const stmdev_ctx_t *ctx,
                                          lsm6dsv80x_fifo_compress_algo_t *val);

/**
  * @brief  Enables ODR CHANGE virtual sensor to be batched in FIFO.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables ODR CHANGE virtual sensor to be batched in FIFO.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_fifo_virtual_sens_odr_chg_set(const stmdev_ctx_t *ctx,
                                                 uint8_t val);

/**
  * @brief  Enables ODR CHANGE virtual sensor to be batched in FIFO.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables ODR CHANGE virtual sensor to be batched in FIFO.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_fifo_virtual_sens_odr_chg_get(const stmdev_ctx_t *ctx,
                                                 uint8_t *val);

/**
  * @brief  Enables/Disables compression algorithm runtime.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables/Disables compression algorithm runtime.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_fifo_compress_algo_real_time_set(const stmdev_ctx_t *ctx,
                                                    uint8_t val);

/**
  * @brief  Enables/Disables compression algorithm runtime.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables/Disables compression algorithm runtime.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_fifo_compress_algo_real_time_get(const stmdev_ctx_t *ctx,
                                                    uint8_t *val);

