CoreMaker-lab/LSM6DSV80X/STM32H5_LSM6DSV80_Project4/Core/Inc/lsm6dsv80x_reg.h
typedef enum
{
  LSM6DSV80X_AUTO          = 0x0,
  LSM6DSV80X_ALWAYS_ACTIVE = 0x1,
} lsm6dsv80x_filt_anti_spike_t;

/**
  * @brief  Protocol anti-spike filters.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      AUTO, ALWAYS_ACTIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_anti_spike_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv80x_filt_anti_spike_t val);

/**
  * @brief  Protocol anti-spike filters.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      AUTO, ALWAYS_ACTIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_anti_spike_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv80x_filt_anti_spike_t *val);

typedef struct
{
  uint8_t drdy                         : 1;
  uint8_t irq_xl                       : 1;
  uint8_t irq_xl_hg                    : 1;
  uint8_t irq_g                        : 1;
} lsm6dsv80x_filt_settling_mask_t;

/**
  * @brief  It masks DRDY and Interrupts RQ until filter settling ends.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It masks DRDY and Interrupts RQ until filter settling ends.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_settling_mask_set(const stmdev_ctx_t *ctx,
                                          lsm6dsv80x_filt_settling_mask_t val);

/**
  * @brief  It masks DRDY and Interrupts RQ until filter settling ends.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It masks DRDY and Interrupts RQ until filter settling ends.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_settling_mask_get(const stmdev_ctx_t *ctx,
                                          lsm6dsv80x_filt_settling_mask_t *val);

typedef enum
{
  LSM6DSV80X_GY_ULTRA_LIGHT   = 0x0,
  LSM6DSV80X_GY_VERY_LIGHT    = 0x1,
  LSM6DSV80X_GY_LIGHT         = 0x2,
  LSM6DSV80X_GY_MEDIUM        = 0x3,
  LSM6DSV80X_GY_STRONG        = 0x4,
  LSM6DSV80X_GY_VERY_STRONG   = 0x5,
  LSM6DSV80X_GY_AGGRESSIVE    = 0x6,
  LSM6DSV80X_GY_XTREME        = 0x7,
} lsm6dsv80x_filt_gy_lp1_bandwidth_t;

/**
  * @brief  Gyroscope low-pass filter (LPF1) bandwidth selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      GY_ULTRA_LIGHT, GY_VERY_LIGHT, GY_LIGHT, GY_MEDIUM, GY_STRONG, GY_VERY_STRONG, GY_AGGRESSIVE, GY_XTREME,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_gy_lp1_bandwidth_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv80x_filt_gy_lp1_bandwidth_t val);

/**
  * @brief  Gyroscope low-pass filter (LPF1) bandwidth selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      GY_ULTRA_LIGHT, GY_VERY_LIGHT, GY_LIGHT, GY_MEDIUM, GY_STRONG, GY_VERY_STRONG, GY_AGGRESSIVE, GY_XTREME,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_gy_lp1_bandwidth_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv80x_filt_gy_lp1_bandwidth_t *val);

/**
  * @brief  It enables gyroscope digital LPF1 filter.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It enables gyroscope digital LPF1 filter.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_gy_lp1_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  It enables gyroscope digital LPF1 filter.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It enables gyroscope digital LPF1 filter.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_gy_lp1_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV80X_XL_ULTRA_LIGHT = 0x0,
  LSM6DSV80X_XL_VERY_LIGHT  = 0x1,
  LSM6DSV80X_XL_LIGHT       = 0x2,
  LSM6DSV80X_XL_MEDIUM      = 0x3,
  LSM6DSV80X_XL_STRONG      = 0x4,
  LSM6DSV80X_XL_VERY_STRONG = 0x5,
  LSM6DSV80X_XL_AGGRESSIVE  = 0x6,
  LSM6DSV80X_XL_XTREME      = 0x7,
} lsm6dsv80x_filt_xl_lp2_bandwidth_t;

/**
  * @brief  Accelerometer LPF2 and high pass filter configuration and cutoff setting.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_ULTRA_LIGHT, XL_VERY_LIGHT, XL_LIGHT, XL_MEDIUM, XL_STRONG, XL_VERY_STRONG, XL_AGGRESSIVE, XL_XTREME,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_xl_lp2_bandwidth_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv80x_filt_xl_lp2_bandwidth_t val);

/**
  * @brief  Accelerometer LPF2 and high pass filter configuration and cutoff setting.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_ULTRA_LIGHT, XL_VERY_LIGHT, XL_LIGHT, XL_MEDIUM, XL_STRONG, XL_VERY_STRONG, XL_AGGRESSIVE, XL_XTREME,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_xl_lp2_bandwidth_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv80x_filt_xl_lp2_bandwidth_t *val);
typedef enum
{
  LSM6DSV80X_XL_FILT_LP_LPF2,
  LSM6DSV80X_XL_FILT_LP_LPF1,
  LSM6DSV80X_XL_FILT_HP,
  LSM6DSV80X_XL_FILT_HP_SLOPE
} lsm6dsv80x_xl_filter;

/**
  * @brief Setup xl filter pipeline from lpf1 filter to UI.
  *
  * @param  ctx      read / write interface definitions
  * @param  filter   LSM6DSV80X_XL_FILT_LP_LPF2, LSM6DSV80X_XL_FILT_LP_LPF1,
  *                  LSM6DSV80X_XL_FILT_HP, LSM6DSV80X_XL_FILT_HP_SLOPE.
  * @param  bw       LSM6DSV80X_GY_ULTRA_LIGHT, LSM6DSV80X_GY_VERY_LIGHT,
  *                  LSM6DSV80X_GY_LIGHT, LSM6DSV80X_GY_MEDIUM, LSM6DSV80X_GY_STRONG,
  *                  LSM6DSV80X_GY_VERY_STRONG, LSM6DSV80X_GY_AGGRESSIVE, LSM6DSV80X_GY_XTREME
  * @param  ref_mode Enables reference mode (Availabe only in LSM6DSV80X_XL_FILT_HP mode)
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_xl_setup(const stmdev_ctx_t *ctx, lsm6dsv80x_xl_filter filter,
                                 lsm6dsv80x_filt_xl_lp2_bandwidth_t bw, uint8_t hp_ref_mode_xl);

/**
  * @brief  Enable accelerometer LPS2 (Low Pass Filter 2) filtering stage.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable accelerometer LPS2 (Low Pass Filter 2) filtering stage.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_xl_lp2_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enable accelerometer LPS2 (Low Pass Filter 2) filtering stage.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable accelerometer LPS2 (Low Pass Filter 2) filtering stage.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_xl_lp2_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Accelerometer slope filter / high-pass filter selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Accelerometer slope filter / high-pass filter selection.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_xl_hp_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Accelerometer slope filter / high-pass filter selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Accelerometer slope filter / high-pass filter selection.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_xl_hp_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Enables accelerometer LPF2 and HPF fast-settling mode. The filter sets the first sample.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables accelerometer LPF2 and HPF fast-settling mode. The filter sets the first sample.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_xl_fast_settling_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables accelerometer LPF2 and HPF fast-settling mode. The filter sets the first sample.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables accelerometer LPF2 and HPF fast-settling mode. The filter sets the first sample.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_filt_xl_fast_settling_get(const stmdev_ctx_t *ctx, uint8_t *val);

