CoreMaker-lab/LSM6DSV80X/STM32H5_LSM6DSV80_Project4/Core/Inc/lsm6dsv80x_reg.h
typedef enum
{
  LSM6DSV80X_DEG_80 = 0x0,
  LSM6DSV80X_DEG_70 = 0x1,
  LSM6DSV80X_DEG_60 = 0x2,
  LSM6DSV80X_DEG_50 = 0x3,
} lsm6dsv80x_6d_threshold_t;

/**
  * @brief  Threshold for 4D/6D function.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEG_80, DEG_70, DEG_60, DEG_50,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_6d_threshold_set(const stmdev_ctx_t *ctx,
                                    lsm6dsv80x_6d_threshold_t val);

/**
  * @brief  Threshold for 4D/6D function.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEG_80, DEG_70, DEG_60, DEG_50,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_6d_threshold_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv80x_6d_threshold_t *val);

/**
  * @brief  4D orientation detection enable. Z-axis position detection is disabled.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      4D orientation detection enable. Z-axis position detection is disabled.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  4D orientation detection enable. Z-axis position detection is disabled.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      4D orientation detection enable. Z-axis position detection is disabled.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  I3C SenseWire (I3C) Configuration
  * @brief     This section group all the functions concerning the
  *            usage of SenseWire (I3C)
  * @{
  *
  */
typedef enum
{
  LSM6DSV80X_I2C_I3C_ENABLE  = 0x0,
  LSM6DSV80X_I2C_I3C_DISABLE = 0x1,
} lsm6dsv80x_ui_i2c_i3c_mode_t;

/**
  * @brief  Disables I2C and I3C on UI (User Interface).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      I2C_I3C_ENABLE, I2C_I3C_DISABLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_ui_i2c_i3c_mode_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv80x_ui_i2c_i3c_mode_t val);

/**
  * @brief  Disables I2C and I3C on UI (User Interface).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      I2C_I3C_ENABLE, I2C_I3C_DISABLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_ui_i2c_i3c_mode_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv80x_ui_i2c_i3c_mode_t *val);

typedef struct
{
  enum
  {
    LSM6DSV80X_SW_RST_DYN_ADDRESS_RST = 0x0,
    LSM6DSV80X_I3C_GLOBAL_RST         = 0x1,
  } rst_mode;
  enum
  {
    LSM6DSV80X_IBI_50us = 0x0,
    LSM6DSV80X_IBI_2us  = 0x1,
    LSM6DSV80X_IBI_1ms  = 0x2,
    LSM6DSV80X_IBI_50ms = 0x3,
  } ibi_time;
} lsm6dsv80x_i3c_config_t;

/**
  * @brief  I3C configuration.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      rst_mode, ibi_time, if2_ta0_pid
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_i3c_config_set(const stmdev_ctx_t *ctx,
                                  lsm6dsv80x_i3c_config_t val);

/**
  * @brief  I3C configuration.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      rst_mode, ibi_time, if2_ta0_pid
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_i3c_config_get(const stmdev_ctx_t *ctx,
                                  lsm6dsv80x_i3c_config_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  SH Sensor hub Configuration
  * @brief     This section groups all the functions that manage the
  *            sensor hub.
  * @{
  *
  */

/**
  * @brief  Sensor Hub controller I2C pull-up enable.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor Hub controller I2C pull-up enable.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_controller_interface_pull_up_set(const stmdev_ctx_t *ctx,
                                                       uint8_t val);

/**
  * @brief  Sensor Hub controller I2C pull-up enable.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor Hub controller I2C pull-up enable.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_controller_interface_pull_up_get(const stmdev_ctx_t *ctx,
                                                       uint8_t *val);

/**
  * @brief  Sensor hub output registers.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor hub output registers.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_read_data_raw_get(const stmdev_ctx_t *ctx, uint8_t *val,
                                        uint8_t len);

typedef enum
{
  LSM6DSV80X_TGT_0       = 0x0,
  LSM6DSV80X_TGT_0_1     = 0x1,
  LSM6DSV80X_TGT_0_1_2   = 0x2,
  LSM6DSV80X_TGT_0_1_2_3 = 0x3,
} lsm6dsv80x_sh_target_connected_t;

/**
  * @brief  Number of external sensors to be read by the sensor hub.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      TGT_0, TGT_0_1, TGT_0_1_2, TGT_0_1_2_3,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_target_connected_set(const stmdev_ctx_t *ctx,
                                           lsm6dsv80x_sh_target_connected_t val);

/**
  * @brief  Number of external sensors to be read by the sensor hub.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      TGT_0, TGT_0_1, TGT_0_1_2, TGT_0_1_2_3,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_target_connected_get(const stmdev_ctx_t *ctx,
                                           lsm6dsv80x_sh_target_connected_t *val);

/**
  * @brief  Sensor hub I2C controller enable.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor hub I2C controller enable.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_controller_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Sensor hub I2C controller enable.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor hub I2C controller enable.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_controller_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  I2C interface pass-through.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      I2C interface pass-through.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_pass_through_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  I2C interface pass-through.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      I2C interface pass-through.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_pass_through_get(const stmdev_ctx_t *ctx, uint8_t *val);

