CoreMaker-lab/LSM6DSV80X/STM32H5_LSM6DSV80_Project4/Core/Inc/lsm6dsv80x_reg.h
typedef enum
{
  LSM6DSV80X_SH_TRG_XL_GY_DRDY = 0x0,
  LSM6DSV80X_SH_TRIG_INT2      = 0x1,
} lsm6dsv80x_sh_syncro_mode_t;

/**
  * @brief  Sensor hub trigger signal selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SH_TRG_XL_GY_DRDY, SH_TRIG_INT2,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_syncro_mode_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv80x_sh_syncro_mode_t val);

/**
  * @brief  Sensor hub trigger signal selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SH_TRG_XL_GY_DRDY, SH_TRIG_INT2,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_syncro_mode_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv80x_sh_syncro_mode_t *val);

typedef enum
{
  LSM6DSV80X_EACH_SH_CYCLE    = 0x0,
  LSM6DSV80X_ONLY_FIRST_CYCLE = 0x1,
} lsm6dsv80x_sh_write_mode_t;

/**
  * @brief  Target 0 write operation is performed only at the first sensor hub cycle.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      EACH_SH_CYCLE, ONLY_FIRST_CYCLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_write_mode_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv80x_sh_write_mode_t val);

/**
  * @brief  Target 0 write operation is performed only at the first sensor hub cycle.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      EACH_SH_CYCLE, ONLY_FIRST_CYCLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_write_mode_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv80x_sh_write_mode_t *val);

/**
  * @brief  Reset Controller logic and output registers. Must be set to ‘1’ and then set it to ‘0’.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Reset Controller logic and output registers. Must be set to ‘1’ and then set it to ‘0’.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_reset_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Reset Controller logic and output registers. Must be set to ‘1’ and then set it to ‘0’.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Reset Controller logic and output registers. Must be set to ‘1’ and then set it to ‘0’.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t   tgt0_add;
  uint8_t   tgt0_subadd;
  uint8_t   tgt0_data;
} lsm6dsv80x_sh_cfg_write_t;

/**
  * @brief  Configure target 0 for perform a write.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      a structure that contain
  *                      - uint8_t tgt1_add;    8 bit i2c device address
  *                      - uint8_t tgt1_subadd; 8 bit register device address
  *                      - uint8_t tgt1_data;   8 bit data to write
  * @retval             interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_cfg_write(const stmdev_ctx_t *ctx,
                                lsm6dsv80x_sh_cfg_write_t *val);
typedef enum
{
  LSM6DSV80X_SH_1Hz875  = 0x0,
  LSM6DSV80X_SH_15Hz    = 0x1,
  LSM6DSV80X_SH_30Hz    = 0x2,
  LSM6DSV80X_SH_60Hz    = 0x3,
  LSM6DSV80X_SH_120Hz   = 0x4,
  LSM6DSV80X_SH_240Hz   = 0x5,
  LSM6DSV80X_SH_480Hz   = 0x6,
} lsm6dsv80x_sh_data_rate_t;

/**
  * @brief  Rate at which the controller communicates.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SH_15Hz, SH_30Hz, SH_60Hz, SH_120Hz, SH_240Hz, SH_480Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_data_rate_set(const stmdev_ctx_t *ctx,
                                    lsm6dsv80x_sh_data_rate_t val);

/**
  * @brief  Rate at which the controller communicates.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SH_15Hz, SH_30Hz, SH_60Hz, SH_120Hz, SH_240Hz, SH_480Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_data_rate_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv80x_sh_data_rate_t *val);

typedef struct
{
  uint8_t   tgt_add;
  uint8_t   tgt_subadd;
  uint8_t   tgt_len;
} lsm6dsv80x_sh_cfg_read_t;

/**
  * @brief  Configure target idx for perform a read.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Structure that contain
  *                      - uint8_t tgt_add;    8 bit i2c device address
  *                      - uint8_t tgt_subadd; 8 bit register device address
  *                      - uint8_t tgt_len;    num of bit to read
  * @retval             interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_tgt_cfg_read(const stmdev_ctx_t *ctx, uint8_t idx,
                                   lsm6dsv80x_sh_cfg_read_t *val);

/**
  * @brief  Sensor hub source register.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      union of registers from STATUS_CONTROLLER to
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_sh_status_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv80x_status_controller_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  UI Serial interfaces Configuration
  * @brief     This section groups all the functions concerning
  *            serial interfaces management (not auxiliary)
  * @{
  *
  */

/**
  * @brief  Enables pull-up on SDO pin of UI (User Interface).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables pull-up on SDO pin of UI (User Interface).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_ui_sdo_pull_up_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables pull-up on SDO pin of UI (User Interface).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables pull-up on SDO pin of UI (User Interface).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_ui_sdo_pull_up_get(const stmdev_ctx_t *ctx, uint8_t *val);

