CoreMaker-lab/LSM6DSV80X/STM32H5_LSM6DSV80_Project4/Core/Inc/lsm6dsv80x_reg.h
typedef enum
{
  LSM6DSV80X_ONLY_SINGLE        = 0x0,
  LSM6DSV80X_BOTH_SINGLE_DOUBLE = 0x1,
} lsm6dsv80x_tap_mode_t;

/**
  * @brief  Single/double-tap event enable.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ONLY_SINGLE, BOTH_SINGLE_DOUBLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_tap_mode_set(const stmdev_ctx_t *ctx, lsm6dsv80x_tap_mode_t val);

/**
  * @brief  Single/double-tap event enable.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ONLY_SINGLE, BOTH_SINGLE_DOUBLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_tap_mode_get(const stmdev_ctx_t *ctx, lsm6dsv80x_tap_mode_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  Tilt Tilt detection Configuration
  * @brief     This section groups all the functions that manage the tilt
  *            event detection.
  * @{
  *
  */

/**
  * @brief  Tilt calculation.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Tilt calculation.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_tilt_mode_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Tilt calculation.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Tilt calculation.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_tilt_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  Timestamp Timestamp Configuration
  * @brief     This section groups all the functions that manage the
  *            timestamp generation.
  * @{
  *
  */

/**
  * @brief  Timestamp data output.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Timestamp data output.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_timestamp_raw_get(const stmdev_ctx_t *ctx, uint32_t *val);

/**
  * @brief  Enables timestamp counter.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables timestamp counter.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables timestamp counter.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables timestamp counter.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  Activity_Inactivity Wake Up/Activity/Inactivity (Sleep) Configuration
  * @brief     This section groups all the functions that manage the Wake Up
  *            event generation.
  * @{
  *
  */

typedef enum
{
  LSM6DSV80X_XL_AND_GY_NOT_AFFECTED       = 0x0,
  LSM6DSV80X_XL_LOW_POWER_GY_NOT_AFFECTED = 0x1,
  LSM6DSV80X_XL_LOW_POWER_GY_SLEEP        = 0x2,
  LSM6DSV80X_XL_LOW_POWER_GY_POWER_DOWN   = 0x3,
} lsm6dsv80x_act_mode_t;

/**
  * @brief  Enable activity/inactivity (sleep) function.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_AND_GY_NOT_AFFECTED, XL_LOW_POWER_GY_NOT_AFFECTED, XL_LOW_POWER_GY_SLEEP, XL_LOW_POWER_GY_POWER_DOWN,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_mode_set(const stmdev_ctx_t *ctx, lsm6dsv80x_act_mode_t val);

/**
  * @brief  Enable activity/inactivity (sleep) function.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_AND_GY_NOT_AFFECTED, XL_LOW_POWER_GY_NOT_AFFECTED, XL_LOW_POWER_GY_SLEEP, XL_LOW_POWER_GY_POWER_DOWN,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_mode_get(const stmdev_ctx_t *ctx, lsm6dsv80x_act_mode_t *val);

typedef enum
{
  LSM6DSV80X_SLEEP_TO_ACT_AT_1ST_SAMPLE = 0x0,
  LSM6DSV80X_SLEEP_TO_ACT_AT_2ND_SAMPLE = 0x1,
  LSM6DSV80X_SLEEP_TO_ACT_AT_3RD_SAMPLE = 0x2,
  LSM6DSV80X_SLEEP_TO_ACT_AT_4th_SAMPLE = 0x3,
} lsm6dsv80x_act_from_sleep_to_act_dur_t;

/**
  * @brief  Duration in the transition from Stationary to Motion (from Inactivity to Activity).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SLEEP_TO_ACT_AT_1ST_SAMPLE, SLEEP_TO_ACT_AT_2ND_SAMPLE, SLEEP_TO_ACT_AT_3RD_SAMPLE, SLEEP_TO_ACT_AT_4th_SAMPLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_from_sleep_to_act_dur_set(const stmdev_ctx_t *ctx,
                                                 lsm6dsv80x_act_from_sleep_to_act_dur_t val);

/**
  * @brief  Duration in the transition from Stationary to Motion (from Inactivity to Activity).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SLEEP_TO_ACT_AT_1ST_SAMPLE, SLEEP_TO_ACT_AT_2ND_SAMPLE, SLEEP_TO_ACT_AT_3RD_SAMPLE, SLEEP_TO_ACT_AT_4th_SAMPLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_from_sleep_to_act_dur_get(const stmdev_ctx_t *ctx,
                                                 lsm6dsv80x_act_from_sleep_to_act_dur_t *val);

typedef enum
{
  LSM6DSV80X_1Hz875 = 0x0,
  LSM6DSV80X_15Hz   = 0x1,
  LSM6DSV80X_30Hz   = 0x2,
  LSM6DSV80X_60Hz   = 0x3,
} lsm6dsv80x_act_sleep_xl_odr_t;

/**
  * @brief  Selects the accelerometer data rate during Inactivity.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      1Hz875, 15Hz, 30Hz, 60Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_sleep_xl_odr_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv80x_act_sleep_xl_odr_t val);

/**
  * @brief  Selects the accelerometer data rate during Inactivity.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      1Hz875, 15Hz, 30Hz, 60Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_sleep_xl_odr_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv80x_act_sleep_xl_odr_t *val);

typedef struct
{
  lsm6dsv80x_inactivity_dur_t inactivity_cfg;
  uint8_t inactivity_ths;
  uint8_t threshold;
  uint8_t duration;
} lsm6dsv80x_act_thresholds_t;

/**
  * @brief  Wakeup and activity/inactivity threshold.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Wakeup and activity/inactivity threshold.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_thresholds_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv80x_act_thresholds_t *val);

/**
  * @brief  Wakeup and activity/inactivity threshold.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Wakeup and activity/inactivity threshold.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_thresholds_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv80x_act_thresholds_t *val);

typedef struct
{
  uint8_t shock                        : 2;
  uint8_t quiet                        : 4;
} lsm6dsv80x_act_wkup_time_windows_t;

/**
  * @brief  Time windows configuration for Wake Up - Activity - Inactivity (SLEEP, WAKE). Duration to go in sleep mode. Default value: 0000 (this corresponds to 16 ODR) 1 LSB = 512/ODR_XL time. Wake up duration event. 1 LSB = 1/ODR_XL time. [set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Time windows configuration for Wake Up - Activity - Inactivity (SLEEP, WAKE). Duration to go in sleep mode. Default value: 0000 (this corresponds to 16 ODR) 1 LSB = 512/ODR_XL time. Wake up duration event. 1 LSB = 1/ODR_XL time.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_wkup_time_windows_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv80x_act_wkup_time_windows_t val);

/**
  * @brief  Time windows configuration for Wake Up - Activity - Inactivity (SLEEP, WAKE). Duration to go in sleep mode. Default value: 0000 (this corresponds to 16 ODR) 1 LSB = 512/ODR_XL time. Wake up duration event. 1 LSB = 1/ODR_XL time. [get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Time windows configuration for Wake Up - Activity - Inactivity (SLEEP, WAKE). Duration to go in sleep mode. Default value: 0000 (this corresponds to 16 ODR) 1 LSB = 512/ODR_XL time. Wake up duration event. 1 LSB = 1/ODR_XL time.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv80x_act_wkup_time_windows_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv80x_act_wkup_time_windows_t *val);

/**
  * @}
  *
  */

/**
  * @}
  *
  */
#ifdef __cplusplus
}
#endif

#endif /*LSM6DSV80X_DRIVER_H */